gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/hrpwm.h
//#############################################################################
//
// FILE:   hrpwm.h
//
// TITLE:   C28x HRPWM Driver
//
//#############################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright:  $
//#############################################################################

#ifndef __HRPWM_H__
#define __HRPWM_H__

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup hrpwm_api
//! @{
//
//*****************************************************************************

// ****************************************************************************
// the includes
// ****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_hrpwm.h"
#include "cpu.h"
#include "debug.h"
#include "interrupt.h"
#include "epwm.h"
#include "hrpwm.h"


//*****************************************************************************
//
// Values that can be passed to the channel variable of
// HRPWM_setHRPWMSyncPulseSource() HRPWM_setHRMEPCtrlMode(),
// HRPWM_setHrCompLoadMode() function
//
//*****************************************************************************
typedef enum
{
    HRPWM_HRPWM_A = 0, //!< HrPWM A
    HRPWM_HRPWM_B = 8  //!< HrPWM B
}HRPWM_Channel;

//*****************************************************************************
//
// Values that can be passed to the mepEdgeMode variable of
// HRPWM_setHRMEPEdgeCtrlMode(),
//
//*****************************************************************************
typedef enum
{
    //! HrPWM is disabled
    HRPWM_MEP_CTRL_DISABLE = 0,
    //! MEP controls rising edge of either CMPAHR and CMPBHR
    HRPWM_MEP_CTRL_CMP_RISING_EDGE = 1,
    //! MEP controls falling edge of either CMPAHR and CMPBHR
    HRPWM_MEP_CTRL_CMP_FALLING_EDGE = 2,
    //! MEP controls both edges of TBPHSHR  TBPRDHR
    HRPWM_MEP_CTRL_TBPHSHR_TBPRDHR_EDGE = 3
}HRPWM_MEPEdgeMode;

//*****************************************************************************
//
// Values that can be passed to the mepCtrlMode variable of
// HRPWM_setHRMEPCtrlMode()
//
//*****************************************************************************
typedef enum
{
    //! MEP controls the edge of CMPAHR/CMPBHR or TBPRDHR
    HRPWM_MEP_CTRL_DUTY_PERIOD = 0,
    //! MEP controls TBPHSHR
    HRPWM_MEP_CTRL_PHASE = 1
}HRPWM_MEPCtrlMode;

//*****************************************************************************
//
// Values that can be passed to HRPWM_setHRComparatorLoadMode,
// HRPWM_setHRRisingEdgeDelayLoadMode() and HRPWM_setHRFallingEdgeDelayLoadMode
// as the loadEvent parameter.
//
//*****************************************************************************
typedef enum
{
    //! load when counter equals zero
    HRPWM_HRPWM_LOAD_ON_CNTER_ZERO = 0,
    //! load when counter equals period
    HRPWM_HRPWM_LOAD_ON_CNTER_PERIOD = 1,
    //! load when counter equals zero or period
    HRPWM_HRPWM_LOAD_ON_CNTER_ZERO_PERIOD = 2
}HRPWM_HRPWMLoadMode;

//*****************************************************************************
//
// Values that can be passed to the outputOnB variable of
// HRPWM_setChannelBOutputPath()
//
//*****************************************************************************
typedef enum
{
    HRPWM_HRPWM_OUTPUT_ON_B_NORMAL = 0, //!< ePWMxB output is normal.
    HRPWM_HRPWM_OUTPUT_ON_B_INV_A  = 1  //!< ePWMxB output is inverted
                                        //!< version of ePWMxA signal
}HRPWM_ChannelBOutput;

//*****************************************************************************
//
// Values that can be passed to the syncPulseSource variable of
// HRPWM_setSyncPulseSource() function
//
//*****************************************************************************
typedef enum
{
    //! Counter equals Period
    HRPWM_PWMSYNC_SOURCE_PERIOD = 0,
	//! Counter equals zero
    HRPWM_PWMSYNC_SOURCE_ZERO = 1,
    //! Counter equals COMPC when counting up
    HRPWM_PWMSYNC_SOURCE_COMPC_UP = 4,
    //! Counter equals COMPC when counting down
    HRPWM_PWMSYNC_SOURCE_COMPC_DOWN = 5,
    //! Counter equals COMPD when counting up
    HRPWM_PWMSYNC_SOURCE_COMPD_UP = 6,
    //! Counter equals COMPD when counting down
    HRPWM_PWMSYNC_SOURCE_COMPD_DOWN = 7
}HRPWM_SyncPulseSource;

//*****************************************************************************
//
// Values that can be passed to the HRPWM_disableCompLoad(),
// HRPWM_setCompCountValue (), HRPWM_setHrMepEdgeMode() function and
// HRPWM_compareLoad_config_t structure as compModule parameter.
//
//*****************************************************************************
typedef enum
{
    HRPWM_COUNTER_COMPARE_A = 0, //!< counter compare A
    HRPWM_COUNTER_COMPARE_B = 4  //!< counter compare B
}HRPWM_CounterCompareModule;

//*****************************************************************************
//
// Values that can be passed to the mepDbEdge variable of
// HRPWM_setHRPWMDeadBandMEPEdgeCtrlMode()
//
//*****************************************************************************
typedef enum
{
    //! HrPWM is disabled
    HRPWM_DB_MEP_CTRL_DISABLE = 0,
    //! MEP controls Rising Edge Delay
    HRPWM_DB_MEP_CTRL_RED = 1,
    //! MEP controls Falling Edge Delay
    HRPWM_DB_MEP_CTRL_FED = 2,
    //! MEP controls both Falling and Rising edge delay
    HRPWM_DB_MEP_CTRL_RED_FED = 3
}HRPWM_MEPDeadBandEdgeMode;

// Functions APIs shared with ePWM module

#define HRPWM_isBaseValid                        EPWM_isBaseValid
#define HRPWM_setTimeBaseCounter                 EPWM_setTimeBaseCounter
#define HRPWM_setCountModeAfterSync              EPWM_setCountModeAfterSync
#define HRPWM_setClockPrescaler                  EPWM_setClockPrescaler
#define HRPWM_swForceSyncPulse                   EPWM_swForceSyncPulse
#define HRPWM_setSyncOutPulseMode                EPWM_setSyncOutPulseMode
#define HRPWM_setPeriodLoadMode                  EPWM_setPeriodLoadMode
#define HRPWM_enablePhaseShiftLoad               EPWM_enablePhaseShiftLoad
#define HRPWM_disablePhaseShiftLoad              EPWM_disablePhaseShiftLoad
#define HRPWM_setTimeBaseCounterMode             EPWM_setTimeBaseCounterMode
#define HRPWM_selectPeriodLoadEvent              EPWM_selectPeriodLoadEvent
#define HRPWM_enableOneShotSync                  EPWM_enableOneShotSync
#define HRPWM_disableOneShotSync                 EPWM_disableOneShotSync
#define HRPWM_startOneShotSync                   EPWM_startOneShotSync
#define HRPWM_getTimeBaseCounterOverflowStatus   \
                                          EPWM_getTimeBaseCounterOverflowStatus
#define HRPWM_clearTimeBaseCounterOverflowEvent \
                                         EPWM_clearTimeBaseCounterOverflowEvent
#define HRPWM_getSyncStatus                      EPWM_getSyncStatus
#define HRPWM_clearSyncEvent                     EPWM_clearSyncEvent
#define HRPWM_getTimeBaseCounterDirection     EPWM_getTimeBaseCounterDirection
#define HRPWM_setPhaseShift                      EPWM_setPhaseShift
#define HRPWM_setupEPWMLinks                     EPWM_setupEPWMLinks
#define HRPWM_setCounterCompareShadowLoadMode \
                                           EPWM_setCounterCompareShadowLoadMode
#define HRPWM_setCounterCompareValue             EPWM_setCounterCompareValue
#define HRPWM_getCounterCompareShadowStatus  \
                                            EPWM_getCounterCompareShadowStatus
#define HRPWM_setActionQualifierShadowLoadMode \
                                       EPWM_setActionQualifierShadowLoadMode
#define HRPWM_setActionQualifierT1TriggerSource \
                                        EPWM_setActionQualifierT1TriggerSource
#define HRPWM_setActionQualifierT2TriggerSource \
                                        EPWM_setActionQualifierT2TriggerSource
#define HRPWM_setActionQualifierAction           EPWM_setActionQualifierAction
#define HRPWM_setActionQualifierContSWForceShadowMode \
                                  EPWM_setActionQualifierContSWForceShadowMode
#define HRPWM_setActionQualifierContSWForceAction \
                                  EPWM_setActionQualifierContSWForceAction
#define HRPWM_setActionQualifierSwAction        EPWM_setActionQualifierSwAction
#define HRPWM_forceActionQualifierSwAction    EPWM_forceActionQualifierSwAction
#define HRPWM_setDeadBandOutputSwapMode          EPWM_setDeadBandOutputSwapMode
#define HRPWM_setDeadBandDelayMode               EPWM_setDeadBandDelayMode
#define HRPWM_setDeadBandDelayPolarity           EPWM_setDeadBandDelayPolarity
#define HRPWM_setRisingEdgeDeadBandDelayInput \
                                         EPWM_setRisingEdgeDeadBandDelayInput
#define HRPWM_setFallingEdgeDeadBandDelayInput \
                                         EPWM_setFallingEdgeDeadBandDelayInput
#define HRPWM_setDeadBandControlShadowLoadMode \
                                         EPWM_setDeadBandControlShadowLoadMode
#define HRPWM_setRisingEdgeDelayCountShadowLoadMode  \
                                   EPWM_setRisingEdgeDelayCountShadowLoadMode
#define HRPWM_setFallingEdgeDelayCountShadowLoadMode \
                                   EPWM_setFallingEdgeDelayCountShadowLoadMode
#define HRPWM_setDeadBandCounterClock            EPWM_setDeadBandCounterClock
#define HRPWM_setRisingEdgeDelayCount            EPWM_setRisingEdgeDelayCount
#define HRPWM_setFallingEdgeDelayCount           EPWM_setFallingEdgeDelayCount
#define HRPWM_enableChopper                      EPWM_enableChopper
#define HRPWM_disableChopper                     EPWM_disableChopper
#define HRPWM_setChopperDutyCycle                EPWM_setChopperDutyCycle
#define HRPWM_setChopperFreq                     EPWM_setChopperFreq
#define HRPWM_setChopperFirstPulseWidt           EPWM_setChopperFirstPulseWidth
#define HRPWM_enableTripZoneSignals              EPWM_enableTripZoneSignals
#define HRPWM_disableTripZoneSignals             EPWM_disableTripZoneSignals
#define HRPWM_setTripZoneDigitalCompareEventCondition   \
                                   EPWM_setTripZoneDigitalCompareEventCondition
#define HRPWM_enableTripZoneAdvAction             EPWM_enableTripZoneAdvAction
#define HRPWM_disableTripZoneAdvAction            EPWM_disableTripZoneAdvAction
#define HRPWM_setTripZoneAction                   EPWM_setTripZoneAction
#define HRPWM_setTripZoneAdvAction                EPWM_setTripZoneAdvAction
#define HRPWM_setTripZoneAdvDigitalCompareActionA \
                                   EPWM_setTripZoneAdvDigitalCompareActionA
#define HRPWM_setTripZoneAdvDigitalCompareActionB \
                                   EPWM_setTripZoneAdvDigitalCompareActionB
#define HRPWM_enableTripZoneInterrupt           EPWM_enableTripZoneInterrupt
#define HRPWM_disableTripZoneInterrupt          EPWM_disableTripZoneInterrupt
#define HRPWM_getTripZoneInterruptStatus        EPWM_getTripZoneInterruptStatus
#define HRPWM_getCycleByCycleTripZoneInterruptStatus \
                                   EPWM_getCycleByCycleTripZoneInterruptStatus
#define HRPWM_getOneShotTripZoneInterruptStatus    \
                                   EPWM_getOneShotTripZoneInterruptStatus
#define HRPWM_selectCycleByCycleTripZoneClearEvent  \
                                   EPWM_selectCycleByCycleTripZoneClearEvent
#define HRPWM_clearTripZoneInterruptFlag        EPWM_clearTripZoneInterruptFlag
#define HRPWM_clearCycleByCycleTripZoneInterruptFlag  \
                                   EPWM_clearCycleByCycleTripZoneInterruptFlag
#define HRPWM_clearOneShotTripZoneInterruptFlag   \
                                   EPWM_clearOneShotTripZoneInterruptFlag
#define HRPWM_forceTripZoneEvent                  EPWM_forceTripZoneEvent
#define HRPWM_enableInterrupt                     EPWM_enableInterrupt
#define HRPWM_disableInterrupt                    EPWM_disableInterrupt
#define HRPWM_setInterruptSource                  EPWM_setInterruptSource
#define HRPWM_setInterruptEventCount              EPWM_setInterruptEventCount
#define HRPWM_getEventTriggerInterruptStatus \
                                           EPWM_getEventTriggerInterruptStatus
#define HRPWM_clearEventTriggerInterruptFlag \
                                           EPWM_clearEventTriggerInterruptFlag
#define HRPWM_enableInterruptEventCountInit \
                                           EPWM_enableInterruptEventCountInit
#define HRPWM_disableInterruptEventCountInit \
                                            EPWM_disableInterruptEventCountInit
#define HRPWM_forceInterruptEventCountInit  \
                                              EPWM_forceInterruptEventCountInit
#define HRPWM_setInterruptEventCountInitValue \
                                           EPWM_setInterruptEventCountInitValue
#define HRPWM_getInterruptEventCount            EPWM_getInterruptEventCount
#define HRPWM_forceEventTriggerInterrupt        EPWM_forceEventTriggerInterrupt
#define HRPWM_enableADCTrigger                  EPWM_enableADCTrigger
#define HRPWM_disableADCTrigger                 EPWM_disableADCTrigger
#define HRPWM_setADCTriggerSource               EPWM_setADCTriggerSource
#define HRPWM_setADCTriggerEventPrescale        EPWM_setADCTriggerEventPrescale
#define HRPWM_getADCTriggerFlagStatus           EPWM_getADCTriggerFlagStatus
#define HRPWM_clearADCTriggerFlag               EPWM_clearADCTriggerFlag
#define HRPWM_enableADCTriggerEventCountInit \
                                          EPWM_enableADCTriggerEventCountInit
#define HRPWM_disableADCTriggerEventCountInit \
                                          EPWM_disableADCTriggerEventCountInit
#define HRPWM_forceADCTriggerEventCountInit \
                                          EPWM_forceADCTriggerEventCountInit
#define HRPWM_setADCTriggerEventCountInitValue \
                                         EPWM_setADCTriggerEventCountInitValue
#define HRPWM_getADCTriggerEventCount             EPWM_getADCTriggerEventCount
#define HRPWM_forceADCTrigger                     EPWM_forceADCTrigger
#define HRPWM_selectDigitalCompareTripInput \
                                            EPWM_selectDigitalCompareTripInput
#define HRPWM_enableDigitalCompareBlankingWindow  \
                                   EPWM_enableDigitalCompareBlankingWindow
#define HRPWM_disableDigitalCompareBlankingWindow  \
                                   EPWM_disableDigitalCompareBlankingWindow
#define HRPWM_enableDigitalCompareWindowInverseMode \
                                   EPWM_enableDigitalCompareWindowInverseMode
#define HRPWM_disableDigitalCompareWindowInverseMode \
                                   EPWM_disableDigitalCompareWindowInverseMode
#define HRPWM_setDigitalCompareBlankingEvent \
                                        EPWM_setDigitalCompareBlankingEvent
#define HRPWM_setDigitalCompareFilterInput \
                                        EPWM_setDigitalCompareFilterInput
#define HRPWM_setDigitalCompareWindowOffset \
                                        EPWM_setDigitalCompareWindowOffset
#define HRPWM_setDigitalCompareWindowLength \
                                         EPWM_setDigitalCompareWindowLength
#define HRPWM_getDigitalCompareBlankingWindowOffsetCount \
                               EPWM_getDigitalCompareBlankingWindowOffsetCount
#define HRPWM_getDigitalCompareBlankingWindowLengthCount  \
                               EPWM_getDigitalCompareBlankingWindowLengthCount
#define HRPWM_setDigitalCompareEventSource \
                                            EPWM_setDigitalCompareEventSource
#define HRPWM_setDigitalCompareEventSyncMode \
                                           EPWM_setDigitalCompareEventSyncMode
#define HRPWM_enableDigitalCompareADCTrigger \
                                           EPWM_enableDigitalCompareADCTrigger
#define HRPWM_disableDigitalCompareADCTrigger \
                                          EPWM_disableDigitalCompareADCTrigger
#define HRPWM_enableDigitalCompareSyncEvent \
                                            EPWM_enableDigitalCompareSyncEvent
#define HRPWM_disableDigitalCompareSyncEvent \
                                           EPWM_disableDigitalCompareSyncEvent
#define HRPWM_enableDigitalCompareCounterCapture  \
                                EPWM_enableDigitalCompareCounterCapture
#define HRPWM_disableDigitalCompareCounterCapture \
                                EPWM_disableDigitalCompareCounterCapture
#define HRPWM_setDigitalCompareCounterShadowMode  \
                                EPWM_setDigitalCompareCounterShadowMode
#define HRPWM_getDigitalCompareCaptureStatus \
                                 EPWM_getDigitalCompareCaptureStatus
#define HRPWM_getDigitalCompareCaptureCount \
                                 EPWM_getDigitalCompareCaptureCount
#define HRPWM_enableDigitalCompareTripCombinationInput \
                                EPWM_enableDigitalCompareTripCombinationInput
#define HRPWM_disableDigitalCompareTripCombinationInput \
                                EPWM_disableDigitalCompareTripCombinationInput
#define HRPWM_enableValleyCapture             EPWM_enableValleyCapture
#define HRPWM_disableValleyCapture            EPWM_disableValleyCapture
#define HRPWM_startValleyCapture              EPWM_startValleyCapture
#define HRPWM_setValleyTriggerSource          EPWM_setValleyTriggerSource
#define HRPWM_setValleyTriggerEdgeCounts      EPWM_setValleyTriggerEdgeCounts
#define HRPWM_enableValleyHardwareDelay       EPWM_enableValleyHardwareDelay
#define HRPWM_disableValleyHWDelay            EPWM_disableValleyHWDelay
#define HRPWM_setValleySWDelayValue           EPWM_setValleySWDelayValue
#define HRPWM_setValleyDelayDivider           EPWM_setValleyDelayDivider
#define HRPWM_getValleyEdgeStatus             EPWM_getValleyEdgeStatus
#define HRPWM_getValleyCount                  EPWM_getValleyCount
#define HRPWM_getValleyHWDelay                EPWM_getValleyHWDelay
#define HRPWM_enableGlobalLoad                EPWM_enableGlobalLoad
#define HRPWM_disableGlobalLoad               EPWM_disableGlobalLoad
#define HRPWM_setGlobalLoadTrigger            EPWM_setGlobalLoadTrigger
#define HRPWM_setGlobalLoadEventPrescale      EPWM_setGlobalLoadEventPrescale
#define HRPWM_getGlobalLoadEventCount         EPWM_getGlobalLoadEventCount
#define HRPWM_disableGlobalLoadOneShotMode    EPWM_disableGlobalLoadOneShotMode
#define HRPWM_enableGlobalLoadOneShotMode     EPWM_enableGlobalLoadOneShotMode
#define HRPWM_setGlobalLoadOneShotLatch       EPWM_setGlobalLoadOneShotLatch
#define HRPWM_forceGlobalLoadOneShotEvent     EPWM_forceGlobalLoadOneShotEvent
#define HRPWM_enableGlobalLoadRegisters       EPWM_enableGlobalLoadRegisters
#define HRPWM_disableGlobalLoadRegisters      EPWM_disableGlobalLoadRegisters
#define HRPWM_lockRegisters                   EPWM_lockRegisters
#define HRPWM_setEmulationMode                EPWM_setEmulationMode
#define HRPWM_registerInterrupt               EPWM_registerInterrupt
#define HRPWM_registerTripZoneInterrupt       EPWM_registerTripZoneInterrupt
#define HRPWM_unregisterInterrupt             EPWM_unregisterInterrupt
#define HRPWM_unregisterTripZoneInterrupt     EPWM_unregisterTripZoneInterrupt

// API Function prototypes
//*****************************************************************************
//
//! Enable sync out loop back.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function enables feedback of the syncout signal.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_enableSelfSync(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // set SELFCLRTRREM bit
    HWREGH(base + EPWM_O_TBCTL2) |= EPWM_TBCTL2_SELFCLRTRREM;
}

//*****************************************************************************
//
//! Disable sync out loop back.
//!
//! \param base is the base address of the EPWM module.
//!
//! This function disables feedback of the syncout signal.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_disableSelfSync(uint32_t base)
{
    ASSERT(EPWM_isBaseValid(base));
    // clear SELFCLRTRREM bit
    HWREGH(base + EPWM_O_TBCTL2) &= ~EPWM_TBCTL2_SELFCLRTRREM;
}

//*****************************************************************************
//
//! Sets the high resolution phase shift value.
//!
//! \param base is the base address of the EPWM module.
//! \param phaseCount is the high resolution phase shift count value.
//!
//! This function sets the high resolution phase shift value. Call the
//! HRPWM_enableHRPhaseShiftLoad() function to enable loading of the phaseCount
//!
//! \b Note: phaseCount is a 24 bit value
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setPhaseShift(uint32_t base, uint32_t phaseCount)
{
    ASSERT(HRPWM_isBaseValid(base));
    // write to TBPHS:TBPHSHR bit
    HWREG(base + HRPWM_O_TBPHS) = phaseCount << 8U;
}

//*****************************************************************************
//
//! Sets the period of the high resolution time base counter.
//!
//! \param base is the base address of the EPWM module.
//! \param periodCount is high resolution period count value.
//!
//! This function sets the period of the high resolution time base counter. The
//! value of periodCount is the value written to the register. User should
//! map the desired period or frequency of the waveform into the correct
//! periodCount.
//!
//! \b Note: periodCount is a 24 bit value
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setTimeBasePeriod(uint32_t base, uint32_t periodCount)
{
    ASSERT(HRPWM_isBaseValid(base));
    // write to TBPRD:TBPRDHR bit
    HWREGH(base + HRPWM_O_TBPRD) = periodCount << 8U;
}

