gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/hrpwm.h
//*****************************************************************************
//
//! Sets the high resolution edge controlled by MEP (Micro Edge Positioner).
//!
//! \param base is the base address of the EPWM module.
//! \param channel is high resolution period module.
//! \param mepEdgeMode edge of the PWM that is controlled by MEP (Micro Edge
//!        Positioner).
//!
//! This function sets the edge of the PWM that is controlled by MEP (Micro
//! Edge Positioner). Valid values for the parameters are:
//!   channel
//!    - HRPWM_HRPWM_A  - HrPWM A
//!    - HRPWM_HRPWM_B  - HrPWM B
//!  mepEdgeMode
//!    - HRPWM_MEP_CTRL_DISABLE              - HrPWM is disabled
//!    - HRPWM_MEP_CTRL_CMP_RISING_EDGE      - MEP (Micro Edge Positioner)
//!                                            controls rising edge CMPAHR
//!                                            or CMPBHR depending on the value
//!                                            channel.
//!    - HRPWM_MEP_CTRL_CMP_FALLING_EDGE     - MEP (Micro Edge Positioner)
//!                                            controls falling edge CMPAHR
//!                                            or CMPBHR depending on the value
//!                                            channel.
//!    - HRPWM_MEP_CTRL_TBPHSHR_TBPRDHR_EDGE - MEP (Micro Edge Positioner)
//!                                            controls both edges of
//!                                            TBPHSHR and TBPRDHR
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setMEPEdgeSelect(uint32_t base,
                                              HRPWM_Channel channel,
                                              HRPWM_MEPEdgeMode mepEdgeMode)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the edge mode
    EALLOW;

    HWREGH(base + HRPWM_O_HRCNFG) =
             ((HWREGH(base + HRPWM_O_HRCNFG) & ~(0x3U << (uint16_t)channel )) |
              ((uint16_t)mepEdgeMode << (uint16_t)channel));
    EDIS;
}

//*****************************************************************************
//
//! Sets the MEP (Micro Edge Positioner) control mode.
//!
//! \param base is the base address of the EPWM module.
//! \param channel is high resolution period module.
//! \param mepCtrlMode is the MEP (Micro Edge Positioner) control mode.
//!
//! This function sets the mode (register type) the MEP (Micro Edge Positioner)
//! will control. Valid values for the parameters are:
//!   channel
//!    - HRPWM_HRPWM_A  - HrPWM A
//!    - HRPWM_HRPWM_B  - HrPWM B
//!   mepCtrlMode
//!    - HRPWM_MEP_CTRL_DUTY_PERIOD   - MEP (Micro Edge Positioner) controls
//!                                     the edge of CMPAHR/CMPBHR
//!                                     depending on the value of channel or
//!                                     TBPRDHR
//!    - HRPWM_MEP_CTRL_PHASE         - MEP (Micro Edge Positioner) controls
//!                                     TBPHSHR
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setMEPControlMode(uint32_t base,
                                          HRPWM_Channel channel,
                                          HRPWM_MEPCtrlMode mepCtrlMode)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the MEP control
    EALLOW;
    HWREGH(base + HRPWM_O_HRCNFG) =
        ((HWREGH(base + HRPWM_O_HRCNFG) & ~(0x1U << ((uint16_t)channel + 2U))) |
         ((uint16_t)mepCtrlMode << ((uint16_t)channel + 2U)));
    EDIS;
}

//*****************************************************************************
//
//! Sets the high resolution comparator load mode.
//!
//! \param base is the base address of the EPWM module.
//! \param channel is high resolution period module.
//! \param loadEvent is the MEP (Micro Edge Positioner) control mode.
//!
//! This function sets the shadow load mode of the high resolution comparator.
//! The function sets the COMPA or COMPB register depending on the channel
//! variable.
//! Valid values for the parameters are:
//!   channel
//!    - HRPWM_HRPWM_A  - HrPWM A
//!    - HRPWM_HRPWM_B  - HrPWM B
//!  loadEvent
//!    - HRPWM_HRPWM_LOAD_ON_CNTER_ZERO       - load when counter equals zero
//!    - HRPWM_HRPWM_LOAD_ON_CNTER_PERIOD     - load when counter equals period
//!    - HRPWM_HRPWM_LOAD_ON_CNTER_ZERO_PERIOD  - load when counter equals zero
//!                                               or period
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setCounterCompareShadowLoadEvent(uint32_t base,
                                                 HRPWM_Channel channel,
                                                 HRPWM_HRPWMLoadMode loadEvent)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the CMPAHR or CMPBHR load mode
    EALLOW;

    HWREGH(base + HRPWM_O_HRCNFG) =
        ((HWREGH(base + HRPWM_O_HRCNFG) & ~(0x3U << ((uint16_t)channel + 3U))) |
         ((uint16_t)loadEvent << ((uint16_t)channel + 3U)));
    EDIS;
}

//*****************************************************************************
//
//! Sets the high resolution output swap mode.
//!
//! \param base is the base address of the EPWM module.
//! \param enableOutputSwap is the output swap flag.
//!
//! This function sets the HrPWM output swap mode. If enableOutputSwap is true,
//! ePWMxA signal appears on ePWMxB output and ePWMxB signal appears on ePWMxA
//! output. If it is false ePWMxA and ePWMxB outputs are unchanged
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setOutputSwapMode(uint32_t base,
                                                bool enableOutputSwap)
{
    ASSERT(HRPWM_isBaseValid(base));

    EALLOW;

    if(enableOutputSwap)
    {
        HWREGH(base + HRPWM_O_HRCNFG) |= HRPWM_HRCNFG_SWAPAB;
    }
    else
    {
        HWREGH(base + HRPWM_O_HRCNFG) &= ~HRPWM_HRCNFG_SWAPAB;
    }
    EDIS;
}

//*****************************************************************************
//
//! Sets the high resolution output on ePWMxB
//!
//! \param base is the base address of the EPWM module.
//! \param outputOnB is the output signal on ePWMxB.
//!
//! This function sets the HrPWM output signal on ePWMxB. If outputOnB is
//! HRPWM_HRPWM_OUTPUT_ON_B_INV_A, ePWMxB output is an inverted version of
//! ePWMxA. If outputOnB is HRPWM_HRPWM_OUTPUT_ON_B_NORMAL, ePWMxB output is
//! ePWMxB.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setChannelBOutputPath(uint32_t base,
                                         HRPWM_ChannelBOutput outputOnB)
{
    ASSERT(HRPWM_isBaseValid(base));

