gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/hrpwm.h
    // Set the High Resolution FED (Falling Edge Delay) count
    HWREGH(base + HRPWM_O_DBFEDHR) = fedCount << 9U;
}

//*****************************************************************************
//
//! Set high resolution MEP (Micro Edge Positioner) step.
//!
//! \param base is the base address of the EPWM module.
//! \param mepCount is the high resolution MEP (Micro Edge Positioner) step
//!        count.
//!
//! This function sets the high resolution MEP (Micro Edge Positioner) step
//! count. The maximum value for the MEP count step is 255.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setMEPStep(uint32_t base, uint16_t mepCount)
{
    ASSERT(HRPWM_isBaseValid(base));

    ASSERT(mepCount < 256U);
    // Set HrPWM MEP count
    EALLOW;

    HWREGH(base + HRPWM_O_HRMSTEP) =
             ((HWREGH(base + HRPWM_O_HRMSTEP) & ~HRPWM_HRMSTEP_HRMSTEP_M) |
               mepCount);
    EDIS;
}

//*****************************************************************************
//
//! Set high resolution Dead Band MEP (Micro Edge Positioner) control.
//!
//! \param base is the base address of the EPWM module.
//! \param mepDbEdge is the high resolution MEP (Micro Edge Positioner) control
//!        edge.
//!
//! This function sets the high resolution Dead Band edge that the MEP (Micro
//! Edge Positioner) controls Valid values for mepDbEdge are:
//!   - HRPWM_DB_MEP_CTRL_DISABLE  - HrPWM is disabled
//!   - HRPWM_DB_MEP_CTRL_RED      - MEP (Micro Edge Positioner) controls
//!                                  Rising Edge Delay
//!   - HRPWM_DB_MEP_CTRL_FED      - MEP (Micro Edge Positioner) controls
//!                                  Falling Edge Delay
//!   - HRPWM_DB_MEP_CTRL_RED_FED  - MEP (Micro Edge Positioner) controls both
//!                                  Falling and Rising edge delays
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setDeadbandMEPEdgeSelect(uint32_t base,
                                           HRPWM_MEPDeadBandEdgeMode mepDbEdge)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the HRPWM DB edge mode
    EALLOW;

    HWREGH(base + HRPWM_O_HRCNFG2) =
       ((HWREGH(base + HRPWM_O_HRCNFG2) & ~HRPWM_HRCNFG2_EDGMODEDB_M) |
         ((uint16_t)mepDbEdge));

    EDIS;
}

//*****************************************************************************
//
//! Set the high resolution Dead Band RED load mode.
//!
//! \param base is the base address of the EPWM module.
//! \param loadEvent is the shadow to active load event.
//!
//! This function sets the high resolution Rising Edge Delay(RED)Dead Band
//! count load mode.
//! Valid values for loadEvent are:
//!   - HRPWM_HRPWM_LOAD_ON_CNTER_ZERO        - load when counter equals zero.
//!   - HRPWM_HRPWM_LOAD_ON_CNTER_PERIOD      - load when counter equals period
//!   - HRPWM_HRPWM_LOAD_ON_CNTER_ZERO_PERIOD - load when counter equals zero
//!                                             or period.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setRisingEdgeDelayLoadMode(uint32_t base,
                                        HRPWM_HRPWMLoadMode loadEvent)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the HRPWM RED load mode
    EALLOW;
    HWREGH(base + HRPWM_O_HRCNFG2) =
      ((HWREGH(base + HRPWM_O_HRCNFG2) & ~HRPWM_HRCNFG2_CTLMODEDBRED_M) |
       ((uint16_t)loadEvent << HRPWM_HRCNFG2_CTLMODEDBRED_S));
    EDIS;
}

//*****************************************************************************
//
//! Set the high resolution Dead Band FED load mode.
//!
//! \param base is the base address of the EPWM module.
//! \param loadEvent is the shadow to active load event.
//!
//! This function sets the high resolution Falling Edge Delay(FED)Dead Band
//! count load mode.
//! Valid values for loadEvent are:
//!   - HRPWM_HRPWM_LOAD_ON_CNTER_ZERO        - load when counter equals zero.
//!   - HRPWM_HRPWM_LOAD_ON_CNTER_PERIOD      - load when counter equals period
//!   - HRPWM_HRPWM_LOAD_ON_CNTER_ZERO_PERIOD - load when counter equals zero
//!                                             or period.
//!
//! \return None.
//
//*****************************************************************************
static inline void HRPWM_setFallingEdgeDelayLoadMode(uint32_t base,
                                         HRPWM_HRPWMLoadMode loadEvent)
{
    ASSERT(HRPWM_isBaseValid(base));

    // Set the HRPWM FED load mode
    EALLOW;
    HWREGH(base + HRPWM_O_HRCNFG2) =
       ((HWREGH(base + HRPWM_O_HRCNFG2) & ~HRPWM_HRCNFG2_CTLMODEDBFED_M) |
        ((uint16_t)loadEvent << HRPWM_HRCNFG2_CTLMODEDBFED_S));
    EDIS;
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // __HRPWM_H__
